AR_cylReactor/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 30e06;

boundaryField
{
    waterInlet
    {
        type            zeroGradient;
    }

    oilInlet
    {
        type            zeroGradient;
    }

    oilInletRight
    {
        type            zeroGradient;
    }

    mainReactorOutlet
    {
        type            fixedValue;
        value           uniform 30e06;
    }

   wall
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type            empty;
     }
}


// ************************************************************************* //
